tap "homebrew/bundle"
tap "homebrew/services"

# Core utilities
brew "coreutils"
brew "findutils"
brew "moreutils"
brew "gnu-sed"

# Shell + Enhancements
brew "zsh"
brew "fzf"
brew "tmux"
brew "powerlevel10k" # optional if not installing via Oh My Zsh

# Dev tools
brew "git"
brew "lazygit"
brew "cmake"
brew "make"
brew "gcc"           # or "llvm" on macOS
brew "go"
brew "lua"
brew "luarocks"
brew "node"
brew "python"
brew "wget"

# Neovim + ecosystem
brew "neovim"
brew "ripgrep"
brew "fd"
brew "bat"
brew "stylua"
brew "shellcheck"
